andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
#define SDIO_CMD0TIMEOUT                      ((uint32_t)0x00010000U)

/**
  * @brief  Mask for errors Card Status R1 (OCR Register)
  */
#define SD_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000U)
#define SD_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000U)
#define SD_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000U)
#define SD_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000U)
#define SD_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000U)
#define SD_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000U)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000U)
#define SD_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000U)
#define SD_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000U)
#define SD_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000U)
#define SD_OCR_CC_ERROR                 ((uint32_t)0x00100000U)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000U)
#define SD_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000U)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000U)
#define SD_OCR_CID_CSD_OVERWRITE        ((uint32_t)0x00010000U)
#define SD_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000U)
#define SD_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000U)
#define SD_OCR_ERASE_RESET              ((uint32_t)0x00002000U)
#define SD_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008U)
#define SD_OCR_ERRORBITS                ((uint32_t)0xFDFFE008U)

/**
  * @brief  Masks for R6 Response
  */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000U)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000U)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000U)

#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000U)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000U)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000U)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AAU)

#define SD_VOLTAGE_WINDOW_WALID         ((uint32_t)0x80000000U)

#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFFU)
#define SD_ALLZERO                      ((uint32_t)0x00000000U)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000U)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000U)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000U)

#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFFU)
#define SD_0TO7BITS                     ((uint32_t)0x000000FFU)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00U)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000U)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000U)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFFU)

#define SD_HALFFIFO                     ((uint32_t)0x00000008U)
#define SD_HALFFIFOBYTES                ((uint32_t)0x00000020U)

/**
  * @brief  Command Class Supported
  */
#define SD_CCCC_LOCK_UNLOCK             ((uint32_t)0x00000080U)
#define SD_CCCC_WRITE_PROT              ((uint32_t)0x00000040U)
#define SD_CCCC_ERASE                   ((uint32_t)0x00000020U)

/**
  * @brief  Following commands are SD Card Specific commands.
  *         SDIO_APP_CMD should be sent before sending these commands.
  */
#define SD_SDIO_SEND_IF_COND            ((uint32_t)SD_CMD_HS_SEND_EXT_CSD)

uint32_t STM32_SD::m_card_type;
uint32_t STM32_SD::m_RCA;
uint32_t STM32_SD::m_CSD[4];
uint32_t STM32_SD::m_CID[4];
SD_CardInfo STM32_SD::m_card_info;

uint32_t STM32_SD::init()
{
    init_gpio();
    ///TODO init_DMA();
    STM32_NVIC::enable_and_set_prior_IRQ(SDIO_IRQn, 0, 0);

    init_low(SDIO_CLOCK_EDGE_RISING, SDIO_CLOCK_BYPASS_DISABLE,
             SDIO_CLOCK_POWER_SAVE_DISABLE, SDIO_BUS_WIDE_1B,
             SDIO_HARDWARE_FLOW_CONTROL_DISABLE, SDIO_INIT_CLK_DIV);

    SD_ErrorTypedef errorstate;

    if ((errorstate = power_ON()) != SD_OK)
        return errorstate;

    if ((errorstate = initialize_cards()) != SD_OK)
        return errorstate;

    if ((errorstate = get_card_info()) != SD_OK)
    {
        select_deselect(m_card_info.RCA << 16);
        return errorstate;
    }

    init_low(SDIO_CLOCK_EDGE_RISING, SDIO_CLOCK_BYPASS_DISABLE,
             SDIO_CLOCK_POWER_SAVE_DISABLE, SDIO_BUS_WIDE_1B,
             SDIO_HARDWARE_FLOW_CONTROL_DISABLE, STM32_SDIO_CLOCK_DIV);

    return errorstate;
}

SD_ErrorTypedef STM32_SD::wide_bus_config(uint32_t mode)
{
    SD_ErrorTypedef errorstate = SD_OK;
    PLC_CONTROL::print_message("wide_bus_config\n");

    /* MMC Card does not support this feature */
    if (m_card_type == MULTIMEDIA_CARD)
        return SD_UNSUPPORTED_FEATURE;
    else if ((m_card_type == STD_CAPACITY_SD_CARD_V1_1) ||
             (m_card_type == STD_CAPACITY_SD_CARD_V2_0) ||
             (m_card_type == HIGH_CAPACITY_SD_CARD))
    {
        if (mode == SDIO_BUS_WIDE_8B)
            errorstate = SD_UNSUPPORTED_FEATURE;
        else if (mode == SDIO_BUS_WIDE_4B)
            errorstate = wide_bus_enable();
        else if (mode == SDIO_BUS_WIDE_1B)
            errorstate = wide_bus_disable();
        else
            /* mode is not a valid argument*/
            errorstate = SD_INVALID_PARAMETER;

        if (errorstate == SD_OK)
        {
            /* Configure the SDIO peripheral */
            init_low(SDIO_CLOCK_EDGE_RISING, SDIO_CLOCK_BYPASS_DISABLE,
                     SDIO_CLOCK_POWER_SAVE_DISABLE, mode,
                     SDIO_HARDWARE_FLOW_CONTROL_DISABLE, STM32_SDIO_CLOCK_DIV);
        }
    }

    return errorstate;
}

SD_TransferStateTypedef STM32_SD::get_status()
{
    SD_CardStateTypedef cardstate =  SD_CARD_TRANSFER;

    cardstate = get_state();

    /* Find SD status according to card state*/
    if (cardstate == SD_CARD_TRANSFER)
        return SD_TRANSFER_OK;
    else if(cardstate == SD_CARD_ERROR)
        return SD_TRANSFER_ERROR;
    else
        return SD_TRANSFER_BUSY;
}

SD_ErrorTypedef STM32_SD::read_blocks(uint8_t *buf, uint64_t read_addr, uint32_t block_size, uint32_t blocks)
{
    SD_ErrorTypedef errorstate = SD_OK;
    uint32_t count = 0U, *tempbuff = (uint32_t*)buf;

    /* Initialize data control register */
    SDIO->DCTRL = 0U;

    if (m_card_type == HIGH_CAPACITY_SD_CARD)
    {
        block_size = 512U;
        read_addr /= 512U;
    }

    /* Set Block Size for Card */
    send_command(block_size, SD_CMD_SET_BLOCKLEN, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_SET_BLOCKLEN);

