andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
    if (errorstate != SD_OK)
        return errorstate;

    /* Configure the SD DPSM (Data Path State Machine) */
    data_config(SD_DATATIMEOUT, blocks * block_size, DATA_BLOCK_SIZE,
                SDIO_TRANSFER_DIR_TO_SDIO, SDIO_TRANSFER_MODE_BLOCK,
                SDIO_DPSM_ENABLE);

    if (blocks > 1U)
    {
        /* Send CMD18 READ_MULT_BLOCK with argument data address */
        send_command(read_addr, SD_CMD_READ_MULT_BLOCK, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    }
    else
    {
        /* Send CMD17 READ_SINGLE_BLOCK */
        send_command(read_addr, SD_CMD_READ_SINGLE_BLOCK, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    }

    /* Read block(s) in polling mode */
    if (blocks > 1U)
    {
        /* Check for error conditions */
        errorstate = cmd_resp1_error(SD_CMD_READ_MULT_BLOCK);

        if (errorstate != SD_OK)
            return errorstate;

        /* Poll on SDIO flags */
        #ifdef SDIO_STA_STBITERR
        while (!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DATAEND | SDIO_FLAG_STBITERR))
        #else /* SDIO_STA_STBITERR not defined */
        while (!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DATAEND))
        #endif /* SDIO_STA_STBITERR */
        {
            if (get_flag(SDIO_FLAG_RXFIFOHF))
            {
                /* Read data from SDIO Rx FIFO */
                for (count = 0U; count < 8U; count++)
                    *(tempbuff + count) = read_FIFO();

                tempbuff += 8U;
            }
        }
    }
    else
    {
    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_READ_SINGLE_BLOCK);

    if (errorstate != SD_OK)
        return errorstate;

    /* In case of single block transfer, no need of stop transfer at all */
    #ifdef SDIO_STA_STBITERR
    while (!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))
    #else /* SDIO_STA_STBITERR not defined */
    while (!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND))
    #endif /* SDIO_STA_STBITERR */
    {
        if (get_flag(SDIO_FLAG_RXFIFOHF))
        {
            /* Read data from SDIO Rx FIFO */
            for (count = 0U; count < 8U; count++)
                *(tempbuff + count) = read_FIFO();

            tempbuff += 8U;
        }
    }
    }

    /* Send stop transmission command in case of multiblock read */
    if (get_flag(SDIO_FLAG_DATAEND) && (blocks > 1U))
    {
        if ((m_card_type == STD_CAPACITY_SD_CARD_V1_1) ||
            (m_card_type == STD_CAPACITY_SD_CARD_V2_0) ||
            (m_card_type == HIGH_CAPACITY_SD_CARD))
            /* Send stop transmission command */
            errorstate = stop_transfer();
    }

    /* Get error state */
    if (get_flag(SDIO_FLAG_DTIMEOUT))
    {
        clear_flag(SDIO_FLAG_DTIMEOUT);
        return SD_DATA_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_DCRCFAIL))
    {
        clear_flag(SDIO_FLAG_DCRCFAIL);
        return SD_DATA_CRC_FAIL;
    }
    else if (get_flag(SDIO_FLAG_RXOVERR))
    {
        clear_flag(SDIO_FLAG_RXOVERR);
        return SD_RX_OVERRUN;
    }
    #ifdef SDIO_STA_STBITERR
    else if (get_flag(SDIO_FLAG_STBITERR))
    {
        clear_flag(SDIO_FLAG_STBITERR);
        return SD_START_BIT_ERR;
    }
    #endif /* SDIO_STA_STBITERR */
    else
    {
        /* No error flag set */
    }

    count = SD_DATATIMEOUT;

    /* Empty FIFO if there is still any data */
    while ((get_flag(SDIO_FLAG_RXDAVL)) && (count > 0U))
    {
        *tempbuff = read_FIFO();
        tempbuff++;
        count--;
    }

    /* Clear all the static flags */
    clear_flag(SDIO_STATIC_FLAGS);

    return errorstate;
}

void STM32_SD::init_gpio()
{
    STM32_RCC::enable_clk_SDIO();

    gpioc.set_config(GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 |
                     GPIO_PIN_11 | GPIO_PIN_12, GPIO_MODE_AF_PP,
                     GPIO_AF12_SDIO, GPIO_SPEED_FREQ_VERY_HIGH,
                     GPIO_NOPULL);

    gpiod.set_config(GPIO_PIN_2, GPIO_MODE_AF_PP, GPIO_AF12_SDIO,
                     GPIO_SPEED_FREQ_VERY_HIGH, GPIO_NOPULL);
}

void STM32_SD::init_low(uint32_t clock_edge, uint32_t clock_bypass,
                        uint32_t clock_power_save, uint32_t bus_wide,
                        uint32_t hw_control, uint32_t clock_div)
{
    uint32_t tmpreg = clock_edge | clock_bypass | clock_power_save |
            bus_wide | hw_control | clock_div;
    MODIFY_REG(SDIO->CLKCR, CLKCR_CLEAR_MASK, tmpreg);
}

SD_ErrorTypedef STM32_SD::power_ON()
{
    disable_SDIO();
    power_state_ON();
    /* 1ms: required power up waiting time before starting the SD initialization sequence */
    STM32_SYSTICK::delay(1);
    enable_SDIO();

    /* CMD0: GO_IDLE_STATE */
    send_command(0, SD_CMD_GO_IDLE_STATE, SDIO_RESPONSE_NO,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    SD_ErrorTypedef errorstate = cmd_error();
    if (errorstate != SD_OK)
    {
        clear_flag(SDIO_STATIC_FLAGS);
        return errorstate;
    }

    /* CMD8: SEND_IF_COND ------------------------------------------------------*/
    /* Send CMD8 to verify SD card interface operating condition */
    /* Argument: - [31:12]: Reserved (shall be set to '0')
    - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    - [7:0]: Check Pattern (recommended 0xAA) */
    uint32_t sdtype = SD_STD_CAPACITY;
    send_command(SD_CHECK_PATTERN, SD_SDIO_SEND_IF_COND, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    errorstate = cmd_resp7_error();
    if (errorstate == SD_OK)
    {
        /* SD Card 2.0 */
        m_card_type = STD_CAPACITY_SD_CARD_V2_0;
        sdtype = SD_HIGH_CAPACITY;
    }

    /* Send CMD55 */
    send_command(0, SD_CMD_APP_CMD, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    /* If errorstate is Command Timeout, it is a MMC card */
    /* If errorstate is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch)
        or SD card 1.x */
    uint32_t response = 0;
    errorstate = cmd_resp1_error(SD_CMD_APP_CMD);
    if (errorstate == SD_OK)
    {
        /* SD CARD */
        /* Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
        uint32_t validvoltage = 0;
        uint32_t count = 0;
        while ((!validvoltage) && (count <SD_MAX_VOLT_TRIAL))
        {
            /* SEND CMD55 APP_CMD with RCA as 0 */
            send_command(0, SD_CMD_APP_CMD, SDIO_RESPONSE_SHORT,
                         SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
            errorstate = cmd_resp1_error(SD_CMD_APP_CMD);
            if (errorstate != SD_OK)
                return errorstate;

