andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
            /* Send CMD41 */
            send_command(SD_VOLTAGE_WINDOW_SD | sdtype, SD_CMD_SD_APP_OP_COND,
                         SDIO_RESPONSE_SHORT, SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
            errorstate = cmd_resp3_error();
            if (errorstate != SD_OK)
                return errorstate;

            /* Get command response */
            response = get_response(SDIO_RESP1);
            validvoltage = ((response & SD_VOLTAGE_WINDOW_WALID) == SD_VOLTAGE_WINDOW_WALID);

            ++count;
        }

        if (count >= SD_MAX_VOLT_TRIAL)
            return SD_INVALID_VOLTRANGE;

        if ((response & SD_HIGH_CAPACITY) == SD_HIGH_CAPACITY)
            m_card_type = HIGH_CAPACITY_SD_CARD;
    } /* else MMC Card */
    else
    {
    }

    return errorstate;
}

SD_ErrorTypedef STM32_SD::power_OFF()
{
    SDIO->POWER = 0x00000000U;
    return SD_OK;
}

SD_ErrorTypedef STM32_SD::send_status(uint32_t *card_status)
{
    SD_ErrorTypedef errorstate = SD_OK;

    if(card_status == nullptr)
        return SD_INVALID_PARAMETER;

    /* Send Status command */
    send_command((m_RCA << 16U), SD_CMD_SEND_STATUS, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_SEND_STATUS);

    if(errorstate != SD_OK)
        return errorstate;

    /* Get SD card status */
    *card_status = get_response(SDIO_RESP1);

    return errorstate;
}

SD_ErrorTypedef STM32_SD::initialize_cards()
{
    SD_ErrorTypedef errorstate = SD_OK;
    uint32_t sd_rca = 1;

    if (get_power_state() == 0)
        /* Power off */
        return SD_REQUEST_NOT_APPLICABLE;

    if (m_card_type != SECURE_DIGITAL_IO_CARD)
    {
        /* Send CMD2 ALL_SEND_CID */
        send_command(0, SD_CMD_ALL_SEND_CID, SDIO_RESPONSE_LONG,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
        if ((errorstate = cmd_resp2_error()) != SD_OK)
            return errorstate;

        m_CID[0] = get_response(SDIO_RESP1);
        m_CID[1] = get_response(SDIO_RESP2);
        m_CID[2] = get_response(SDIO_RESP3);
        m_CID[3] = get_response(SDIO_RESP4);
    }

    if ((m_card_type == STD_CAPACITY_SD_CARD_V1_1) || (m_card_type == STD_CAPACITY_SD_CARD_V2_0) ||
        (m_card_type == SECURE_DIGITAL_IO_COMBO_CARD) || (m_card_type == HIGH_CAPACITY_SD_CARD))
    {
        /* Send CMD3 SET_REL_ADDR with argument 0 */
        /* SD Card publishes its RCA. */
        send_command(0, SD_CMD_SET_REL_ADDR, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
        if ((errorstate = cmd_resp6_error(SD_CMD_SET_REL_ADDR, &sd_rca)) != SD_OK)
            return errorstate;
    }

    if (m_card_type !=SECURE_DIGITAL_IO_CARD)
    {
        /* Get the SD card RCA */
        m_RCA = sd_rca;

        /* Send CMD9 SEND_CSD with argument as card's RCA */
        send_command(m_RCA << 16, SD_CMD_SEND_CSD, SDIO_RESPONSE_LONG,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
        if ((errorstate = cmd_resp2_error()) != SD_OK)
            return errorstate;

        m_CSD[0] = get_response(SDIO_RESP1);
        m_CSD[1] = get_response(SDIO_RESP2);
        m_CSD[2] = get_response(SDIO_RESP3);
        m_CSD[3] = get_response(SDIO_RESP4);
    }

    return errorstate;
}

void STM32_SD::send_command(uint32_t arg, uint32_t cmd_idx,
                            uint32_t resp, uint32_t wait_IT,
                            uint32_t cpsm)
{
    SDIO->ARG = arg;
    MODIFY_REG(SDIO->CMD, CMD_CLEAR_MASK, (cmd_idx | resp |
                                           wait_IT | cpsm));
}

SD_ErrorTypedef STM32_SD::cmd_error()
{
    WAIT_TIMEOUT_EX((!get_flag(SDIO_FLAG_CMDSENT)), SDIO_CMD0TIMEOUT, SD_CMD_RSP_TIMEOUT);
    clear_flag(SDIO_STATIC_FLAGS);
    return SD_OK;
}

SD_ErrorTypedef STM32_SD::cmd_resp7_error()
{
    WAIT_TIMEOUT_EX((!get_flag(SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)),
                 SDIO_CMD0TIMEOUT, SD_CMD_RSP_TIMEOUT);

    if (get_flag(SDIO_FLAG_CTIMEOUT))
    {
        /* Card is not V2.0 compliant or card does not support the set voltage range */
        clear_flag(SDIO_FLAG_CTIMEOUT);
        return SD_CMD_RSP_TIMEOUT;
    }
    if (get_flag(SDIO_FLAG_CMDREND))
    {
        /* Card is SD V2.0 compliant */
        clear_flag(SDIO_FLAG_CMDREND);
        return SD_OK;
    }

    return SD_ERROR;
}

SD_ErrorTypedef STM32_SD::cmd_resp1_error(uint32_t SD_CMD)
{
    while (!get_flag(SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) {}

    if (get_flag(SDIO_FLAG_CTIMEOUT))
    {
        clear_flag(SDIO_FLAG_CTIMEOUT);
        PLC_CONTROL::print_message("Timeout\n");
        return SD_CMD_RSP_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_CCRCFAIL))
    {
        clear_flag(SDIO_FLAG_CCRCFAIL);
        PLC_CONTROL::print_message("CRC failed\n");
        return SD_CMD_CRC_FAIL;
    }

    /* Check response received is of desired command */
    if (get_cmd_response() != SD_CMD)
    {
        PLC_CONTROL::print_message("Illegal CMD\n");
        return SD_ILLEGAL_CMD;
    }

    /* Clear all the static flags */
    clear_flag(SDIO_STATIC_FLAGS);

    uint32_t response_r1 = get_response(SDIO_RESP1);

    if ((response_r1 & SD_OCR_ERRORBITS) == SD_ALLZERO)
        return SD_OK;

    if ((response_r1 & SD_OCR_ADDR_OUT_OF_RANGE))
        return SD_ADDR_OUT_OF_RANGE;

    if ((response_r1 & SD_OCR_ADDR_MISALIGNED))
        return SD_ADDR_MISALIGNED;

    if ((response_r1 & SD_OCR_BLOCK_LEN_ERR))
        return SD_BLOCK_LEN_ERR;

    if ((response_r1 & SD_OCR_ERASE_SEQ_ERR))
        return SD_ERASE_SEQ_ERR;

    if ((response_r1 & SD_OCR_BAD_ERASE_PARAM))
        return SD_BAD_ERASE_PARAM;

    if ((response_r1 & SD_OCR_WRITE_PROT_VIOLATION))
        return SD_WRITE_PROT_VIOLATION;

    if ((response_r1 & SD_OCR_LOCK_UNLOCK_FAILED))
        return SD_LOCK_UNLOCK_FAILED;

    if ((response_r1 & SD_OCR_COM_CRC_FAILED))
        return SD_COM_CRC_FAILED;

    /*if ((response_r1 & SD_OCR_ILLEGAL_CMD))
        return SD_ILLEGAL_CMD;*/

    if ((response_r1 & SD_OCR_CARD_ECC_FAILED))
        return SD_CARD_ECC_FAILED;

