andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
    if ((response_r1 & SD_OCR_CC_ERROR))
        return SD_CC_ERROR;

    if ((response_r1 & SD_OCR_GENERAL_UNKNOWN_ERROR))
        return SD_GENERAL_UNKNOWN_ERROR;

    if ((response_r1 & SD_OCR_STREAM_READ_UNDERRUN))
        return SD_STREAM_READ_UNDERRUN;

    if ((response_r1 & SD_OCR_STREAM_WRITE_OVERRUN))
        return SD_STREAM_WRITE_OVERRUN;

    if ((response_r1 & SD_OCR_CID_CSD_OVERWRITE))
        return SD_CID_CSD_OVERWRITE;

    if ((response_r1 & SD_OCR_WP_ERASE_SKIP))
        return SD_WP_ERASE_SKIP;

    if ((response_r1 & SD_OCR_CARD_ECC_DISABLED))
        return SD_CARD_ECC_DISABLED;

    if ((response_r1 & SD_OCR_ERASE_RESET))
        return SD_ERASE_RESET;

    if ((response_r1 & SD_OCR_AKE_SEQ_ERROR))
        return SD_AKE_SEQ_ERROR;

    return SD_OK;
}

SD_ErrorTypedef STM32_SD::cmd_resp3_error()
{
    while (!get_flag(SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) {}

    if (get_flag(SDIO_FLAG_CTIMEOUT))
    {
        clear_flag(SDIO_FLAG_CTIMEOUT);
        return SD_CMD_RSP_TIMEOUT;
    }

    clear_flag(SDIO_STATIC_FLAGS);
    return SD_OK;
}

SD_ErrorTypedef STM32_SD::cmd_resp2_error()
{
    while (!get_flag(SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) {}

    if (get_flag(SDIO_FLAG_CTIMEOUT))
    {
        clear_flag(SDIO_FLAG_CTIMEOUT);
        return SD_CMD_RSP_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_CCRCFAIL))
    {
        clear_flag(SDIO_FLAG_CCRCFAIL);
        return SD_CMD_CRC_FAIL;
    }

    clear_flag(SDIO_STATIC_FLAGS);
    return SD_OK;
}

SD_ErrorTypedef STM32_SD::cmd_resp6_error(uint8_t SD_CMD, uint32_t *pRCA)
{
    while (!get_flag(SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) {}

    if (get_flag(SDIO_FLAG_CTIMEOUT))
    {
        clear_flag(SDIO_FLAG_CTIMEOUT);
        return SD_CMD_RSP_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_CCRCFAIL))
    {
        clear_flag(SDIO_FLAG_CCRCFAIL);
        return SD_CMD_CRC_FAIL;
    }

    if (get_cmd_response() !=SD_CMD)
        return SD_ILLEGAL_CMD;

    clear_flag(SDIO_STATIC_FLAGS);

    uint32_t response_r1 = get_response(SDIO_RESP1);

    if ((response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO)
    {
        *pRCA = response_r1 >> 16;
        return SD_OK;
    }

    if (response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR)
        return SD_GENERAL_UNKNOWN_ERROR;
    if (response_r1 & SD_R6_ILLEGAL_CMD)
        return SD_ILLEGAL_CMD;
    if (response_r1 & SD_R6_COM_CRC_FAILED)
        return SD_COM_CRC_FAILED;

    return SD_OK;
}

SD_ErrorTypedef STM32_SD::data_config(uint32_t time_out, uint32_t dat_len,
                                      uint32_t block_size, uint32_t transf_dir,
                                      uint32_t transf_mode, uint32_t DPSM)
{
    SDIO->DTIMER = time_out;
    SDIO->DLEN = dat_len;
    uint32_t tmpreg = block_size | transf_dir | transf_mode | DPSM;
    MODIFY_REG(SDIO->DCTRL, DCTRL_CLEAR_MASK, tmpreg);
    return SD_OK;
}

SD_ErrorTypedef STM32_SD::stop_transfer()
{
    send_command(0, SD_CMD_STOP_TRANSMISSION, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    return cmd_resp1_error(SD_CMD_STOP_TRANSMISSION);
}

SD_ErrorTypedef STM32_SD::get_card_info()
{
    SD_ErrorTypedef errorstate = SD_OK;

    m_card_info.CardType = m_card_type;
    m_card_info.RCA = m_RCA;

    /* Byte 1 */
    uint32_t tmp = (m_CSD[0U] & 0x00FF0000U) >> 16U;
    m_card_info.SD_csd.TAAC = (uint8_t)tmp;

    /* Byte 2 */
    tmp = (m_CSD[0U] & 0x0000FF00U) >> 8U;
    m_card_info.SD_csd.NSAC = (uint8_t)tmp;

    /* Byte 3 */
    tmp = m_CSD[0U] & 0x000000FFU;
    m_card_info.SD_csd.MaxBusClkFrec = (uint8_t)tmp;

    /* Byte 4 */
    tmp = (m_CSD[1U] & 0xFF000000U) >> 24U;
    m_card_info.SD_csd.CardComdClasses = (uint16_t)(tmp << 4U);

    /* Byte 5 */
    tmp = (m_CSD[1U] & 0x00FF0000U) >> 16U;
    m_card_info.SD_csd.CardComdClasses |= (uint16_t)((tmp & 0xF0) >> 4U);
    m_card_info.SD_csd.RdBlockLen       = (uint8_t)(tmp & 0x0FU);

    /* Byte 6 */
    tmp = (m_CSD[1U] & 0x0000FF00U) >> 8U;
    m_card_info.SD_csd.PartBlockRead   = (uint8_t)((tmp & 0x80U) >> 7U);
    m_card_info.SD_csd.WrBlockMisalign = (uint8_t)((tmp & 0x40U) >> 6U);
    m_card_info.SD_csd.RdBlockMisalign = (uint8_t)((tmp & 0x20U) >> 5U);
    m_card_info.SD_csd.DSRImpl         = (uint8_t)((tmp & 0x10U) >> 4U);
    m_card_info.SD_csd.Reserved2       = 0U; /*!< Reserved */

    if ((m_card_type == STD_CAPACITY_SD_CARD_V1_1) || (m_card_type == STD_CAPACITY_SD_CARD_V2_0))
    {
        m_card_info.SD_csd.DeviceSize = (tmp & 0x03U) << 10U;

        /* Byte 7 */
        tmp = (uint8_t)(m_CSD[1U] & 0x000000FFU);
        m_card_info.SD_csd.DeviceSize |= (tmp) << 2U;

        /* Byte 8 */
        tmp = (uint8_t)((m_CSD[2U] & 0xFF000000U) >> 24U);
        m_card_info.SD_csd.DeviceSize |= (tmp & 0xC0U) >> 6U;

        m_card_info.SD_csd.MaxRdCurrentVDDMin = (tmp & 0x38U) >> 3U;
        m_card_info.SD_csd.MaxRdCurrentVDDMax = (tmp & 0x07U);

        /* Byte 9 */
        tmp = (uint8_t)((m_CSD[2U] & 0x00FF0000U) >> 16U);
        m_card_info.SD_csd.MaxWrCurrentVDDMin = (tmp & 0xE0U) >> 5U;
        m_card_info.SD_csd.MaxWrCurrentVDDMax = (tmp & 0x1CU) >> 2U;
        m_card_info.SD_csd.DeviceSizeMul      = (tmp & 0x03U) << 1U;
        /* Byte 10 */
        tmp = (uint8_t)((m_CSD[2U] & 0x0000FF00U) >> 8U);
        m_card_info.SD_csd.DeviceSizeMul |= (tmp & 0x80U) >> 7U;

        m_card_info.CardCapacity  = (m_card_info.SD_csd.DeviceSize + 1U) ;
        m_card_info.CardCapacity *= (1U << (m_card_info.SD_csd.DeviceSizeMul + 2U));
        m_card_info.CardBlockSize = 1U << (m_card_info.SD_csd.RdBlockLen);
        m_card_info.CardCapacity *= m_card_info.CardBlockSize;
    }
    else if (m_card_type == HIGH_CAPACITY_SD_CARD)
    {
        /* Byte 7 */
        tmp = (uint8_t)(m_CSD[1U] & 0x000000FFU);
        m_card_info.SD_csd.DeviceSize = (tmp & 0x3FU) << 16U;

        /* Byte 8 */
        tmp = (uint8_t)((m_CSD[2U] & 0xFF000000U) >> 24U);

        m_card_info.SD_csd.DeviceSize |= (tmp << 8U);

