andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
        /* Byte 9 */
        tmp = (uint8_t)((m_CSD[2U] & 0x00FF0000U) >> 16U);

        m_card_info.SD_csd.DeviceSize |= (tmp);

        /* Byte 10 */
        tmp = (uint8_t)((m_CSD[2U] & 0x0000FF00U) >> 8U);

        m_card_info.CardCapacity = (uint64_t)((((uint64_t)m_card_info.SD_csd.DeviceSize + 1U)) * 512U * 1024U);
        m_card_info.CardBlockSize = 512U;
    }
    else
    {
        /* Not supported card type */
        errorstate = SD_ERROR;
    }

    m_card_info.SD_csd.EraseGrSize = (tmp & 0x40U) >> 6U;
    m_card_info.SD_csd.EraseGrMul  = (tmp & 0x3FU) << 1U;

    /* Byte 11 */
    tmp = (uint8_t)(m_CSD[2U] & 0x000000FFU);
    m_card_info.SD_csd.EraseGrMul     |= (tmp & 0x80U) >> 7U;
    m_card_info.SD_csd.WrProtectGrSize = (tmp & 0x7FU);

    /* Byte 12 */
    tmp = (uint8_t)((m_CSD[3U] & 0xFF000000U) >> 24U);
    m_card_info.SD_csd.WrProtectGrEnable = (tmp & 0x80U) >> 7U;
    m_card_info.SD_csd.ManDeflECC        = (tmp & 0x60U) >> 5U;
    m_card_info.SD_csd.WrSpeedFact       = (tmp & 0x1CU) >> 2U;
    m_card_info.SD_csd.MaxWrBlockLen     = (tmp & 0x03U) << 2U;

    /* Byte 13 */
    tmp = (uint8_t)((m_CSD[3U] & 0x00FF0000U) >> 16U);
    m_card_info.SD_csd.MaxWrBlockLen      |= (tmp & 0xC0U) >> 6U;
    m_card_info.SD_csd.WriteBlockPaPartial = (tmp & 0x20U) >> 5U;
    m_card_info.SD_csd.Reserved3           = 0U;
    m_card_info.SD_csd.ContentProtectAppli = (tmp & 0x01U);

    /* Byte 14 */
    tmp = (uint8_t)((m_CSD[3U] & 0x0000FF00U) >> 8U);
    m_card_info.SD_csd.FileFormatGrouop = (tmp & 0x80U) >> 7U;
    m_card_info.SD_csd.CopyFlag         = (tmp & 0x40U) >> 6U;
    m_card_info.SD_csd.PermWrProtect    = (tmp & 0x20U) >> 5U;
    m_card_info.SD_csd.TempWrProtect    = (tmp & 0x10U) >> 4U;
    m_card_info.SD_csd.FileFormat       = (tmp & 0x0CU) >> 2U;
    m_card_info.SD_csd.ECC              = (tmp & 0x03U);

    /* Byte 15 */
    tmp = (uint8_t)(m_CSD[3U] & 0x000000FFU);
    m_card_info.SD_csd.CSD_CRC   = (tmp & 0xFEU) >> 1U;
    m_card_info.SD_csd.Reserved4 = 1U;

    /* Byte 0 */
    tmp = (uint8_t)((m_CID[0U] & 0xFF000000U) >> 24U);
    m_card_info.SD_cid.ManufacturerID = tmp;

    /* Byte 1 */
    tmp = (uint8_t)((m_CID[0U] & 0x00FF0000U) >> 16U);
    m_card_info.SD_cid.OEM_AppliID = tmp << 8U;

    /* Byte 2 */
    tmp = (uint8_t)((m_CID[0U] & 0x0000FF00U) >> 8U);
    m_card_info.SD_cid.OEM_AppliID |= tmp;

    /* Byte 3 */
    tmp = (uint8_t)(m_CID[0U] & 0x000000FFU);
    m_card_info.SD_cid.ProdName1 = tmp << 24U;

    /* Byte 4 */
    tmp = (uint8_t)((m_CID[1U] & 0xFF000000U) >> 24U);
    m_card_info.SD_cid.ProdName1 |= tmp << 16U;

    /* Byte 5 */
    tmp = (uint8_t)((m_CID[1U] & 0x00FF0000U) >> 16U);
    m_card_info.SD_cid.ProdName1 |= tmp << 8U;

    /* Byte 6 */
    tmp = (uint8_t)((m_CID[1U] & 0x0000FF00U) >> 8U);
    m_card_info.SD_cid.ProdName1 |= tmp;

    /* Byte 7 */
    tmp = (uint8_t)(m_CID[1U] & 0x000000FFU);
    m_card_info.SD_cid.ProdName2 = tmp;

    /* Byte 8 */
    tmp = (uint8_t)((m_CID[2U] & 0xFF000000U) >> 24U);
    m_card_info.SD_cid.ProdRev = tmp;

    /* Byte 9 */
    tmp = (uint8_t)((m_CID[2U] & 0x00FF0000U) >> 16U);
    m_card_info.SD_cid.ProdSN = tmp << 24U;

    /* Byte 10 */
    tmp = (uint8_t)((m_CID[2U] & 0x0000FF00U) >> 8U);
    m_card_info.SD_cid.ProdSN |= tmp << 16U;

    /* Byte 11 */
    tmp = (uint8_t)(m_CID[2U] & 0x000000FFU);
    m_card_info.SD_cid.ProdSN |= tmp << 8U;

    /* Byte 12 */
    tmp = (uint8_t)((m_CID[3U] & 0xFF000000U) >> 24U);
    m_card_info.SD_cid.ProdSN |= tmp;

    /* Byte 13 */
    tmp = (uint8_t)((m_CID[3U] & 0x00FF0000U) >> 16U);
    m_card_info.SD_cid.Reserved1   |= (tmp & 0xF0U) >> 4U;
    m_card_info.SD_cid.ManufactDate = (tmp & 0x0FU) << 8U;

    /* Byte 14 */
    tmp = (uint8_t)((m_CID[3U] & 0x0000FF00U) >> 8U);
    m_card_info.SD_cid.ManufactDate |= tmp;

    /* Byte 15 */
    tmp = (uint8_t)(m_CID[3U] & 0x000000FFU);
    m_card_info.SD_cid.CID_CRC   = (tmp & 0xFEU) >> 1U;
    m_card_info.SD_cid.Reserved2 = 1U;

    return errorstate;
}

SD_ErrorTypedef STM32_SD::select_deselect(uint32_t addr)
{
    send_command(addr, SD_CMD_SEL_DESEL_CARD, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);
    return cmd_resp1_error(SD_CMD_SEL_DESEL_CARD);
}

SD_ErrorTypedef STM32_SD::wide_bus_enable()
{
    SD_ErrorTypedef errorstate = SD_OK;
    PLC_CONTROL::print_message("wide_bus_enable\n");

    uint32_t scr[2U] = {0U, 0U};

    if ((get_response(SDIO_RESP1) & SD_CARD_LOCKED) == SD_CARD_LOCKED)
        return SD_LOCK_UNLOCK_FAILED;

    /* Get SCR Register */
    errorstate = find_SCR(scr);

    if (errorstate != SD_OK)
        return errorstate;

    /* If requested card supports wide bus operation */
    if ((scr[1U] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO)
    {
        /* Send CMD55 APP_CMD with argument as card's RCA.*/
        send_command(m_RCA << 16U, SD_CMD_APP_CMD, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

        /* Check for error conditions */
        errorstate = cmd_resp1_error(SD_CMD_APP_CMD);

        if(errorstate != SD_OK)
            return errorstate;

        /* Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
        send_command(2, SD_CMD_APP_SD_SET_BUSWIDTH, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

        /* Check for error conditions */
        errorstate = cmd_resp1_error(SD_CMD_APP_SD_SET_BUSWIDTH);
    }
    else
        return SD_REQUEST_NOT_APPLICABLE;

    return errorstate;
}

SD_ErrorTypedef STM32_SD::wide_bus_disable()
{
    SD_ErrorTypedef errorstate = SD_OK;

    uint32_t scr[2U] = {0U, 0U};

    if ((get_response(SDIO_RESP1) & SD_CARD_LOCKED) == SD_CARD_LOCKED)
        return SD_LOCK_UNLOCK_FAILED;

    /* Get SCR Register */
    errorstate = find_SCR(scr);

    if (errorstate != SD_OK)
        return errorstate;

    /* If requested card supports 1 bit mode operation */
    if ((scr[1U] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
    {
        /* Send CMD55 APP_CMD with argument as card's RCA */
        send_command(m_RCA << 16U, SD_CMD_APP_CMD, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

        /* Check for error conditions */
        errorstate = cmd_resp1_error(SD_CMD_APP_CMD);

        if(errorstate != SD_OK)
            return errorstate;

