andreili/STM32-PLC/firmware/fw_cpu/src/stm32_sd.cpp
        /* Send ACMD6 APP_CMD with argument as 0 for single bus mode */
        send_command(0, SD_CMD_APP_SD_SET_BUSWIDTH, SDIO_RESPONSE_SHORT,
                     SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

        /* Check for error conditions */
        errorstate = cmd_resp1_error(SD_CMD_APP_SD_SET_BUSWIDTH);
    }
    else
        return SD_REQUEST_NOT_APPLICABLE;

    return errorstate;
}

SD_ErrorTypedef STM32_SD::find_SCR(uint32_t *scr)
{
    SD_ErrorTypedef errorstate = SD_OK;
    uint32_t index = 0U;
    uint32_t tempscr[2U] = {0U, 0U};

    /* Set Block Size To 8 Bytes */
    /* Send CMD55 APP_CMD with argument as card's RCA */
    send_command(8, SD_CMD_SET_BLOCKLEN, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_SET_BLOCKLEN);

    if (errorstate != SD_OK)
        return errorstate;

    /* Send CMD55 APP_CMD with argument as card's RCA */
    send_command((m_RCA << 16U), SD_CMD_APP_CMD, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_APP_CMD);

    if (errorstate != SD_OK)
        return errorstate;

    data_config(SD_DATATIMEOUT, 8U,
                SDIO_DATABLOCK_SIZE_8B, SDIO_TRANSFER_DIR_TO_SDIO,
                SDIO_TRANSFER_MODE_BLOCK, SDIO_DPSM_ENABLE);

    /* Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
    send_command(0, SD_CMD_SD_APP_SEND_SCR, SDIO_RESPONSE_SHORT,
                 SDIO_WAIT_NO, SDIO_CPSM_ENABLE);

    /* Check for error conditions */
    errorstate = cmd_resp1_error(SD_CMD_SD_APP_SEND_SCR);

    if (errorstate != SD_OK)
        return errorstate;

    #ifdef SDIO_STA_STBITERR
    while(!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))
    #else /* SDIO_STA_STBITERR not defined */
    while(!get_flag(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND))
    #endif /* SDIO_STA_STBITERR */
    {
        if(get_flag(SDIO_FLAG_RXDAVL))
        {
            *(tempscr + index) = read_FIFO();
            index++;
        }
    }

    if (get_flag(SDIO_FLAG_DTIMEOUT))
    {
        clear_flag(SDIO_FLAG_DTIMEOUT);
        return SD_DATA_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_DCRCFAIL))
    {
        clear_flag(SDIO_FLAG_DCRCFAIL);
        return SD_DATA_TIMEOUT;
    }
    else if (get_flag(SDIO_FLAG_RXOVERR))
    {
        clear_flag(SDIO_FLAG_RXOVERR);
        return SD_RX_OVERRUN;
    }
    #ifdef SDIO_STA_STBITERR
    else if (get_flag(SDIO_FLAG_STBITERR))
    {
        clear_flag(SDIO_FLAG_STBITERR);
        return SD_START_BIT_ERR;
    }
    #endif /* SDIO_STA_STBITERR */
    else
    {
        /* No error flag set */
    }

    /* Clear all the static flags */
    clear_flag(SDIO_STATIC_FLAGS);

    *(scr + 1U) = ((tempscr[0U] & SD_0TO7BITS) << 24U)  | ((tempscr[0U] & SD_8TO15BITS) << 8U) |
                  ((tempscr[0U] & SD_16TO23BITS) >> 8U) | ((tempscr[0U] & SD_24TO31BITS) >> 24U);

    *(scr) = ((tempscr[1U] & SD_0TO7BITS) << 24U)  | ((tempscr[1U] & SD_8TO15BITS) << 8U) |
             ((tempscr[1U] & SD_16TO23BITS) >> 8U) | ((tempscr[1U] & SD_24TO31BITS) >> 24U);

    return errorstate;
}

SD_CardStateTypedef STM32_SD::get_state()
{
    uint32_t resp1 = 0U;

    if (send_status(&resp1) != SD_OK)
        return SD_CARD_ERROR;
    else
        return (SD_CardStateTypedef)((resp1 >> 9U) & 0x0FU);
}

void ISR::SDIO_IRQ()
{
    ///TODO
}
